<a href="https://colab.research.google.com/github/kim-hyun-ho/study/blob/main/210331.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

2021.03.0
파이썬

#판다스

##시계열데이터 등 다룸
##결측치 처리 용이

In [8]:
#읽기
#csv,excel,json,pickle
##저장은 csv,json,pickle

import numpy as np
import pandas as pd

obj = pd.Series([0,1,2,3,4,5,6,7], index=['a','b','c','d','e','f','g','h'], dtype='int64')
obj = pd.Series([x for x in range(8)], index=[x for x in 'abcdefgh'], dtype='int64')
obj

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
dtype: int64

In [9]:
obj[1:3]

b    1
c    2
dtype: int64

In [10]:
obj[obj<3]

a    0
b    1
c    2
dtype: int64

In [11]:
obj['c']

2

In [12]:
obj[['e','c']]

e    4
c    2
dtype: int64

In [13]:
obj.c

2

In [14]:
obj['d':'e']=100
obj

a      0
b      1
c      2
d    100
e    100
f      5
g      6
h      7
dtype: int64

In [15]:
obj.iloc[2]

2

In [16]:
obj.iloc[[2]]

c    2
dtype: int64

In [17]:
obj.iloc[1:4]

b      1
c      2
d    100
dtype: int64

In [18]:
obj.loc['a':'c']

a    0
b    1
c    2
dtype: int64

In [25]:
frame = pd.DataFrame(np.arange(24).reshape(4,-1),
    columns=[ f'c{x}' for x in range(1,7)],
    index=[f'r{x}' for x in range(1,5)])
frame

    c1  c2  c3  c4  c5  c6
r1   0   1   2   3   4   5
r2   6   7   8   9  10  11
r3  12  13  14  15  16  17
r4  18  19  20  21  22  23

In [26]:
frame['r1':'r2']

    c1  c2  c3  c4  c5  c6
r1   0   1   2   3   4   5
r2   6   7   8   9  10  11

In [27]:
frame[['c1','c2']] #리스트로 감싸줘야 함.

    c1  c2
r1   0   1
r2   6   7
r3  12  13
r4  18  19

In [28]:
frame['c1':'c2']

Empty DataFrame
Columns: [c1, c2, c3, c4, c5, c6]
Index: []

In [33]:
frame.iloc[[0],[3]]

    c4
r1   3

In [35]:
frame.iloc[[0,1],1:4]

    c2  c3  c4
r1   1   2   3
r2   7   8   9

In [43]:
frame.iloc[[0,1],[1,2,3]]

    c2  c3  c4
r1   1   2   3
r2   7   8   9

In [47]:
frame.iloc[0:2,1:4] #리스트로 줘도 되고 슬라이싱 조건으로 줘도 된다.

    c2  c3  c4
r1   1   2   3
r2   7   8   9

In [49]:
frame.loc['r1':'r2',['c2','c3','c4']] #라벨 슬라이싱은 끝라벨도 포함.

    c2  c3  c4
r1   1   2   3
r2   7   8   9

In [57]:
s1 = pd.Series([1,2,3,4], index= ['a','b','c','d'])
s3 = pd.Series([10,20,30,40], index=['a','b','c','d'])
s3 = pd.Series([10,20,30,40], index=list('abcd'))
s1+s2

a    11
b    22
c    33
d    44
dtype: int64

In [59]:
s1 = pd.Series([1,2,3,4], index=list('abcd'))
s1 = pd.Series([2,2,2,2], index=list('bcde'))
#시리즈는 짝이 맞지 않는 값은 NaN할당
s1+s3

a     NaN
b    22.0
c    32.0
d    42.0
e     NaN
dtype: float64

In [60]:
# 결측치를 채워줄 수도 있음
s1.add(s3, fill_value=0)

a    10.0
b    22.0
c    32.0
d    42.0
e     2.0
dtype: float64

#기술 통계 계산과 요약

In [68]:
# head/tail
filepath = "https://raw.githubusercontent.com/Youngpyoryu/SD_academy/main/%ED%8C%8C%EC%9D%B4%EC%8D%AC/kbo.csv"
df =  pd.read_csv(filepath)
df.head()

     연도  순위   팀  경기수   승   패  무     승률   게임차
0  2019   1  두산  144  88  55  1  0.615   0.0
1  2019   2  키움  144  86  57  1  0.601   2.0
2  2019   3  SK  144  88  55  1  0.615   0.0
3  2019   4  LG  144  79  64  1  0.552   9.0
4  2019   5  NC  144  73  69  2  0.514  14.5

In [69]:
df.tail()

      연도  순위   팀  경기수   승   패  무     승률   게임차
25  2017   6  LG  144  69  72  3  0.489  17.0
26  2017   7  넥센  144  69  73  2  0.486  17.5
27  2017   8  한화  144  61  81  2  0.430  25.5
28  2017   9  삼성  144  55  84  5  0.396  30.0
29  2017  10  KT  144  50  94  0  0.347  37.5

In [66]:
# head/tail
filepath = "https://raw.githubusercontent.com/Youngpyoryu/SD_academy/main/%ED%8C%8C%EC%9D%B4%EC%8D%AC/stock_2020_01.csv"
df =  pd.read_csv(filepath,encoding='cp949')
df.head()

                    Date    kospi  kosdaq  gold_fut_132030  Bond_273130
0  2020. 1. 2 오후 3:30:00  2175.17  674.02            10845       108215
1  2020. 1. 3 오후 3:30:00  2176.46  669.93            11000       108565
2  2020. 1. 6 오후 3:30:00  2155.07  655.31            11245       108745
3  2020. 1. 7 오후 3:30:00  2175.54  663.44            11180       108400
4  2020. 1. 8 오후 3:30:00  2151.31  640.94            11360       108270

In [72]:
df.shape

(30, 9)

In [74]:
df.describe()

                연도         순위    경기수  ...          무         승률        게임차
count    30.000000  30.000000   30.0  ...  30.000000  30.000000  30.000000
mean   2018.000000   5.466667  144.0  ...   1.600000   0.499800  12.833333
std       0.830455   2.921187    0.0  ...   1.275769   0.082079  12.576204
min    2017.000000   1.000000  144.0  ...   0.000000   0.340000 -14.500000
25%    2017.000000   3.000000  144.0  ...   1.000000   0.431750   2.375000
50%    2018.000000   5.000000  144.0  ...   1.000000   0.494500   9.750000
75%    2019.000000   8.000000  144.0  ...   2.000000   0.558000  19.500000
max    2019.000000  10.000000  144.0  ...   5.000000   0.646000  39.000000

[8 rows x 8 columns]

In [75]:
df.columns #features

Index(['연도', '순위', '팀', '경기수', '승', '패', '무', '승률', '게임차'], dtype='object')

In [79]:
obj = pd.Series([2,1,3,3,1,np.nan,34,5])
obj.unique() #중복 삭제

array([ 2.,  1.,  3., nan, 34.,  5.])

In [ ]:
obj.values

In [83]:
obj.value_counts()

3.0     2
1.0     2
5.0     1
34.0    1
2.0     1
dtype: int64

In [84]:
obj.value_counts(normalize=True)

3.0     0.285714
1.0     0.285714
5.0     0.142857
34.0    0.142857
2.0     0.142857
dtype: float64

In [ ]:
#정규분포, 정규화(노말라이징) 이유, (벡터 노말라이징?)

In [ ]:
obj.sort_index() #axis = 0 : 인덱스, 1 : 컬럼

In [88]:
obj.sort_index(ascending=True) #오름, 내림 차순

0     2.0
1     1.0
2     3.0
3     3.0
4     1.0
5     NaN
6    34.0
7     5.0
dtype: float64

In [89]:
obj.sort_values()

1     1.0
4     1.0
0     2.0
2     3.0
3     3.0
7     5.0
6    34.0
5     NaN
dtype: float64

In [90]:
obj.sort_values(na_position='first')

5     NaN
1     1.0
4     1.0
0     2.0
2     3.0
3     3.0
7     5.0
6    34.0
dtype: float64

In [92]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('def'),index=list('abc'))
frame

   d  e  f
a  0  1  2
b  3  4  5
c  6  7  8

In [102]:
#series.apply(func,arg,**kwds)
#func:적용될 함수
#args: series를 제외한 함수에 들어갈 다른 매개변수
#**kwds:함수에 넘겨줄 키워드 인자들

s=pd.Series([20,21,12],index='London,New York,Helsinki'.split(','))
s

London      20
New York    21
Helsinki    12
dtype: int64

In [106]:
def sub_custom_values(x,val):
    return x-val
s.apply(sub_custom_values,args=(10,))

London      10
New York    11
Helsinki     2
dtype: int64

In [110]:
def add_custom_values(x, **kwargs):
    for month in kwargs:
        x+=kwargs[month]
    return x

s.apply(add_custom_values, june=30, july=20, august=25)

London      95
New York    96
Helsinki    87
dtype: int64

In [112]:
frame=pd.DataFrame(np.arange(12).reshape(3,-1),columns=list('abcd'))
frame

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [113]:
frame.applymap(lambda x:x**2)

    a   b    c    d
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [114]:
frame=pd.DataFrame(np.arange(16).reshape(4,-1),columns='c1 c2 c3 c4'.split(),index='r1 r2 r3 r4'.split())
frame

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [116]:
frame_1 = frame.drop('r1') #리턴 없음
frame_1

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [124]:
frame_1 = frame.drop('c1',axis=1)# 컬럼 접근하려면 axis 설정
frame_1 = frame.drop(columns=['c1','c2'])#동일효과
#frame.drop(columns=['c1'],inplace=True)하면 결과 반영됨. 잘 안씀 -> 백업없이 삭제 위험
frame_1

    c3  c4
r1   2   3
r2   6   7
r3  10  11
r4  14  15

In [ ]:
## 데이터 병합 merge

# frame.fillna()

### method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
###     Method to use for filling holes in reindexed Series
###     pad / ffill: propagate last valid observation forward to next valid
###     backfill / bfill: use next valid observation to fill gap.